Revit 2024 API
Connector.AllowsSlopeAdjustments Property
 Indicates if the connector allows the slope adjustment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool AllowsSlopeAdjustments { get; }
Visual Basic
Public ReadOnly Property AllowsSlopeAdjustments As Boolean
	Get
Visual C++
public:
property bool AllowsSlopeAdjustments {
	bool get ();
}
See Also
Connector Class
Autodesk.Revit.DB Namespace